In [70]:
import pandas as pd
import numpy as np

In [71]:
dfone=pd.read_csv('messages.csv')
dftwo=pd.read_csv('orders.csv')

In [72]:
dfone.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [73]:
dftwo.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [74]:
dfone.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [75]:
dftwo['date']=pd.to_datetime(dfone['date'])

In [76]:
dftwo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

extracting year

In [78]:
dftwo['year']=dftwo['date'].dt.year

In [57]:
dftwo.head()

                 date  product_id  city_id  orders  year
0 2013-12-15 00:50:00        5628       25       3  2013
1 2014-04-29 23:40:00        3646       14     157  2014
2 2012-12-30 00:21:00        1859       25       1  2012
3 2014-11-28 00:31:00        7292       25       1  2014
4 2013-10-26 23:11:00        4344       25       3  2013

extracting month

In [58]:
dftwo['month']=dfone['date'].dt.month

In [79]:
dftwo['month_name']=dftwo['date'].dt.month_name()

extracting date

In [80]:
dftwo['dfone_date']=dftwo['date'].dt.day

In [81]:
dftwo.head()

,date,product_id,city_id,orders,year,month_name,dfone_date
0,2013-12-15 00:50:00,5628,25,3,2013,December,15
1,2014-04-29 23:40:00,3646,14,157,2014,April,29
2,2012-12-30 00:21:00,1859,25,1,2012,December,30
3,2014-11-28 00:31:00,7292,25,1,2014,November,28
4,2013-10-26 23:11:00,4344,25,3,2013,October,26

extracting day of the weak

In [82]:
dftwo['day']=dftwo['date'].dt.day_name()

In [83]:
dftwo.head()

,date,product_id,city_id,orders,year,month_name,dfone_date,day
0,2013-12-15 00:50:00,5628,25,3,2013,December,15,Sunday
1,2014-04-29 23:40:00,3646,14,157,2014,April,29,Tuesday
2,2012-12-30 00:21:00,1859,25,1,2012,December,30,Sunday
3,2014-11-28 00:31:00,7292,25,1,2014,November,28,Friday
4,2013-10-26 23:11:00,4344,25,3,2013,October,26,Saturday

is weekend

In [84]:
dftwo['is_weekend']=np.where(dftwo['day'].isin(['saturday','sunday']),1,0)

In [85]:
dftwo.head()

,date,product_id,city_id,orders,year,month_name,dfone_date,day,is_weekend
0,2013-12-15 00:50:00,5628,25,3,2013,December,15,Sunday,0
1,2014-04-29 23:40:00,3646,14,157,2014,April,29,Tuesday,0
2,2012-12-30 00:21:00,1859,25,1,2012,December,30,Sunday,0
3,2014-11-28 00:31:00,7292,25,1,2014,November,28,Friday,0
4,2013-10-26 23:11:00,4344,25,3,2013,October,26,Saturday,0

extracting week of the year

In [50]:
# dfone['week_of_the_year']=dfone['date'].dt.week

In [87]:
dfone.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

handling time

In [92]:
# converting into datatime
dfone['date']=pd.to_datetime(dfone['date'])

In [93]:
dfone.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [94]:
# hour min second
dfone['hour']=dfone['date'].dt.hour
dfone['min']=dfone['date'].dt.minute
dfone['sec']=dfone['date'].dt.second

In [69]:
dfone.head()

,date,msg,year,month,month_name,dfone_date,day,is_weekend,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,2013,12,December,15,Sunday,0,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,2014,4,April,29,Tuesday,0,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,2012,12,December,30,Sunday,0,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,2014,11,November,28,Friday,0,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,2013,10,October,26,Saturday,0,23,11,0

extracting time part

In [95]:
dfone['time']=dfone['date'].dt.time

In [96]:
dfone.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00